tutorials/multiphase/vof/vofSolver/ras/waterChannel/constant/transportProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoPhase
{
    transportModel  twoPhase;
    phase1          phase1;
    phase2          phase2;
}

phase1
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0]  1e-06;
    rho             [1 -3 0 0 0 0 0] 1000;
}

phase2
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0]  1.48e-05;
    rho             [1 -3 0 0 0 0 0] 1;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.07;


// ************************************************************************* //
